Revit 2027 API
StairsRun.LocationLineJustification Property
 The position of the run relative to the Up-direction path used to create the run.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public StairsRunJustification LocationLineJustification { get; set; }
Public Property LocationLineJustification As StairsRunJustification
	Get
	Set
public:
property StairsRunJustification LocationLineJustification {
	StairsRunJustification get ();
	void set (StairsRunJustification value);
}
member LocationLineJustification : StairsRunJustification with get, set
Property Value
StairsRunJustification
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
InvalidOperationException |  The stairs run is sketched so the data being set is not applicable.
Remarks
 Only common runs(straight, spiral, winder) have location line justification.
See Also
Reference
StairsRun Class
Autodesk.Revit.DB.Architecture Namespace